# Промышленные объекты и их координаты
from typing import Any

plants_list = [
    # lat, lon
    [55.577916, 51.829092],  # Камский завод полимерных материалов
    [55.580406, 51.832423],  # Нижнекамский завод металлических конструкций
    [55.600826, 52.006558],  # Нижнекамсктехуглерод
    [55.611971, 51.949400],  # Нижнекамскнефтехим (завод Этилен)
    [55.607269, 51.918995],  # Промзона 1_1
    [55.596030, 51.916050],  # Промзона 1_2
    [55.608176, 51.950205],  # Промзона 2_1
    [55.594242, 51.953988],  # Промзона 2_2
    [55.611434, 51.968755],  # Нижнекамскшина (массовые шины)
    [55.611325, 51.984527],  # Нижнекамскшина (грузовые шины)
    [55.568804, 51.887739],  # Таиф-НК, завод бензинов
    [55.590493, 51.943682],  # Таиф-НК, комплекс глубокой переработки нефти
    [55.595089, 51.808537],  # Камасталь
    [55.567365, 51.909208],  # Танеко
    [55.604712, 51.963051],  # Завод Эластик
    [55.602338, 51.808578],  # Криоген-НК
    [55.602188, 51.844907],  # Камэнергостройпром
    # [55.612118, 51.975523],    # Нижнекамский механический завод
]

# Меняем местами широту и долготу для GeoJSON
plants_dict_geojson: dict[str | Any, list[float] | Any] = {
    # lon, lat
    'Камский завод полимерных материалов': [51.829092, 55.577916],
    'Нижнекамский завод металлических конструкций': [51.832423, 55.580406],
    'Нижнекамсктехуглерод': [52.006558, 55.600826],
    'Нижнекамскнефтехим (завод Этилен)': [51.9494, 55.611971],
    'Промзона 1_1': [51.918995, 55.607269],
    'Промзона 1_2': [51.91605, 55.59603],
    'Промзона 2_1': [51.950205, 55.608176],
    'Промзона 2_2': [51.953988, 55.594242],
    'Нижнекамскшина (массовые шины)': [51.968755, 55.611434],
    'Нижнекамскшина (грузовые шины)': [51.984527, 55.611325],
    'Таиф-НК, завод бензинов': [51.887739, 55.568804],
    'Таиф-НК, комплекс глубокой переработки нефти': [51.943682, 55.590493],
    'Камасталь': [51.808537, 55.595089],
    'Танеко': [51.909208, 55.567365],
    'Завод Эластик': [51.963051, 55.604712],
    'Криоген-НК': [51.808578, 55.602338],
    'Камэнергостройпром': [51.844907, 55.602188]
}

# Временной лаг
lags = 4

meteo_params = ['T внеш., °C',
                'P атм., мм.рт.ст.',
                'V ветра, м/с',
                'Угол ветра, °',
                'Направление ветра'
                ]

# Загрязнители в алфавитном порядке
substances = ['CO, мг/м³',
              'H2S, мг/м³',
              'NH3, мг/м³',
              'NO, мг/м³',
              'NO2, мг/м³',
              'SO2, мг/м³'
              ]
# Молекулярные массы веществ из substances
Mr = [28, 30, 46, 17, 64, 34]

threshold = {
    # [повышенная конц., ПДК]
    'CO, мг/м³': [1.2, 5],
    'NO, мг/м³': [0.06, 0.4],
    'NO2, мг/м³': [0.12, 0.2],
    'NH3, мг/м³': [0.03, 0.2],
    'SO2, мг/м³': [0.25, 0.5],
    'H2S, мг/м³': [0.006, 0.008]
}
